Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/component/mclk.h
#define MCLK_CLKMSK_MASK0_Pos                 _UINT32_(0)                                          /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK0_Msk                 (_UINT32_(0x1) << MCLK_CLKMSK_MASK0_Pos)             /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK0(value)              (MCLK_CLKMSK_MASK0_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK0_Pos)) /* Assignment of value for MASK0 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK0_0_Val             _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK0_1_Val             _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK0_0                   (MCLK_CLKMSK_MASK0_0_Val << MCLK_CLKMSK_MASK0_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK0_1                   (MCLK_CLKMSK_MASK0_1_Val << MCLK_CLKMSK_MASK0_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK1_Pos                 _UINT32_(1)                                          /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK1_Msk                 (_UINT32_(0x1) << MCLK_CLKMSK_MASK1_Pos)             /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK1(value)              (MCLK_CLKMSK_MASK1_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK1_Pos)) /* Assignment of value for MASK1 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK1_0_Val             _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK1_1_Val             _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK1_0                   (MCLK_CLKMSK_MASK1_0_Val << MCLK_CLKMSK_MASK1_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK1_1                   (MCLK_CLKMSK_MASK1_1_Val << MCLK_CLKMSK_MASK1_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK2_Pos                 _UINT32_(2)                                          /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK2_Msk                 (_UINT32_(0x1) << MCLK_CLKMSK_MASK2_Pos)             /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK2(value)              (MCLK_CLKMSK_MASK2_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK2_Pos)) /* Assignment of value for MASK2 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK2_0_Val             _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK2_1_Val             _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK2_0                   (MCLK_CLKMSK_MASK2_0_Val << MCLK_CLKMSK_MASK2_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK2_1                   (MCLK_CLKMSK_MASK2_1_Val << MCLK_CLKMSK_MASK2_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK3_Pos                 _UINT32_(3)                                          /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK3_Msk                 (_UINT32_(0x1) << MCLK_CLKMSK_MASK3_Pos)             /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK3(value)              (MCLK_CLKMSK_MASK3_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK3_Pos)) /* Assignment of value for MASK3 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK3_0_Val             _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK3_1_Val             _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK3_0                   (MCLK_CLKMSK_MASK3_0_Val << MCLK_CLKMSK_MASK3_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK3_1                   (MCLK_CLKMSK_MASK3_1_Val << MCLK_CLKMSK_MASK3_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK4_Pos                 _UINT32_(4)                                          /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK4_Msk                 (_UINT32_(0x1) << MCLK_CLKMSK_MASK4_Pos)             /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK4(value)              (MCLK_CLKMSK_MASK4_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK4_Pos)) /* Assignment of value for MASK4 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK4_0_Val             _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK4_1_Val             _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK4_0                   (MCLK_CLKMSK_MASK4_0_Val << MCLK_CLKMSK_MASK4_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK4_1                   (MCLK_CLKMSK_MASK4_1_Val << MCLK_CLKMSK_MASK4_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK5_Pos                 _UINT32_(5)                                          /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK5_Msk                 (_UINT32_(0x1) << MCLK_CLKMSK_MASK5_Pos)             /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK5(value)              (MCLK_CLKMSK_MASK5_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK5_Pos)) /* Assignment of value for MASK5 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK5_0_Val             _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK5_1_Val             _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK5_0                   (MCLK_CLKMSK_MASK5_0_Val << MCLK_CLKMSK_MASK5_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK5_1                   (MCLK_CLKMSK_MASK5_1_Val << MCLK_CLKMSK_MASK5_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK6_Pos                 _UINT32_(6)                                          /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK6_Msk                 (_UINT32_(0x1) << MCLK_CLKMSK_MASK6_Pos)             /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK6(value)              (MCLK_CLKMSK_MASK6_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK6_Pos)) /* Assignment of value for MASK6 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK6_0_Val             _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK6_1_Val             _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK6_0                   (MCLK_CLKMSK_MASK6_0_Val << MCLK_CLKMSK_MASK6_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK6_1                   (MCLK_CLKMSK_MASK6_1_Val << MCLK_CLKMSK_MASK6_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK7_Pos                 _UINT32_(7)                                          /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK7_Msk                 (_UINT32_(0x1) << MCLK_CLKMSK_MASK7_Pos)             /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK7(value)              (MCLK_CLKMSK_MASK7_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK7_Pos)) /* Assignment of value for MASK7 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK7_0_Val             _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK7_1_Val             _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK7_0                   (MCLK_CLKMSK_MASK7_0_Val << MCLK_CLKMSK_MASK7_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK7_1                   (MCLK_CLKMSK_MASK7_1_Val << MCLK_CLKMSK_MASK7_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK8_Pos                 _UINT32_(8)                                          /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK8_Msk                 (_UINT32_(0x1) << MCLK_CLKMSK_MASK8_Pos)             /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK8(value)              (MCLK_CLKMSK_MASK8_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK8_Pos)) /* Assignment of value for MASK8 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK8_0_Val             _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK8_1_Val             _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK8_0                   (MCLK_CLKMSK_MASK8_0_Val << MCLK_CLKMSK_MASK8_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK8_1                   (MCLK_CLKMSK_MASK8_1_Val << MCLK_CLKMSK_MASK8_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK9_Pos                 _UINT32_(9)                                          /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK9_Msk                 (_UINT32_(0x1) << MCLK_CLKMSK_MASK9_Pos)             /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK9(value)              (MCLK_CLKMSK_MASK9_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK9_Pos)) /* Assignment of value for MASK9 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK9_0_Val             _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK9_1_Val             _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK9_0                   (MCLK_CLKMSK_MASK9_0_Val << MCLK_CLKMSK_MASK9_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK9_1                   (MCLK_CLKMSK_MASK9_1_Val << MCLK_CLKMSK_MASK9_Pos)   /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK10_Pos                _UINT32_(10)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK10_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK10_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK10(value)             (MCLK_CLKMSK_MASK10_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK10_Pos)) /* Assignment of value for MASK10 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK10_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK10_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK10_0                  (MCLK_CLKMSK_MASK10_0_Val << MCLK_CLKMSK_MASK10_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK10_1                  (MCLK_CLKMSK_MASK10_1_Val << MCLK_CLKMSK_MASK10_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK11_Pos                _UINT32_(11)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK11_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK11_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK11(value)             (MCLK_CLKMSK_MASK11_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK11_Pos)) /* Assignment of value for MASK11 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK11_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK11_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK11_0                  (MCLK_CLKMSK_MASK11_0_Val << MCLK_CLKMSK_MASK11_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK11_1                  (MCLK_CLKMSK_MASK11_1_Val << MCLK_CLKMSK_MASK11_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK12_Pos                _UINT32_(12)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK12_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK12_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK12(value)             (MCLK_CLKMSK_MASK12_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK12_Pos)) /* Assignment of value for MASK12 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK12_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK12_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK12_0                  (MCLK_CLKMSK_MASK12_0_Val << MCLK_CLKMSK_MASK12_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK12_1                  (MCLK_CLKMSK_MASK12_1_Val << MCLK_CLKMSK_MASK12_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK13_Pos                _UINT32_(13)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK13_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK13_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK13(value)             (MCLK_CLKMSK_MASK13_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK13_Pos)) /* Assignment of value for MASK13 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK13_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK13_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK13_0                  (MCLK_CLKMSK_MASK13_0_Val << MCLK_CLKMSK_MASK13_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK13_1                  (MCLK_CLKMSK_MASK13_1_Val << MCLK_CLKMSK_MASK13_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK14_Pos                _UINT32_(14)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK14_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK14_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK14(value)             (MCLK_CLKMSK_MASK14_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK14_Pos)) /* Assignment of value for MASK14 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK14_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK14_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK14_0                  (MCLK_CLKMSK_MASK14_0_Val << MCLK_CLKMSK_MASK14_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK14_1                  (MCLK_CLKMSK_MASK14_1_Val << MCLK_CLKMSK_MASK14_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK15_Pos                _UINT32_(15)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK15_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK15_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK15(value)             (MCLK_CLKMSK_MASK15_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK15_Pos)) /* Assignment of value for MASK15 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK15_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK15_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK15_0                  (MCLK_CLKMSK_MASK15_0_Val << MCLK_CLKMSK_MASK15_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK15_1                  (MCLK_CLKMSK_MASK15_1_Val << MCLK_CLKMSK_MASK15_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK16_Pos                _UINT32_(16)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK16_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK16_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK16(value)             (MCLK_CLKMSK_MASK16_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK16_Pos)) /* Assignment of value for MASK16 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK16_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK16_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK16_0                  (MCLK_CLKMSK_MASK16_0_Val << MCLK_CLKMSK_MASK16_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK16_1                  (MCLK_CLKMSK_MASK16_1_Val << MCLK_CLKMSK_MASK16_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK17_Pos                _UINT32_(17)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK17_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK17_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK17(value)             (MCLK_CLKMSK_MASK17_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK17_Pos)) /* Assignment of value for MASK17 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK17_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK17_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK17_0                  (MCLK_CLKMSK_MASK17_0_Val << MCLK_CLKMSK_MASK17_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK17_1                  (MCLK_CLKMSK_MASK17_1_Val << MCLK_CLKMSK_MASK17_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK18_Pos                _UINT32_(18)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK18_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK18_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK18(value)             (MCLK_CLKMSK_MASK18_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK18_Pos)) /* Assignment of value for MASK18 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK18_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK18_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK18_0                  (MCLK_CLKMSK_MASK18_0_Val << MCLK_CLKMSK_MASK18_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK18_1                  (MCLK_CLKMSK_MASK18_1_Val << MCLK_CLKMSK_MASK18_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK19_Pos                _UINT32_(19)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK19_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK19_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
#define MCLK_CLKMSK_MASK19(value)             (MCLK_CLKMSK_MASK19_Msk & (_UINT32_(value) << MCLK_CLKMSK_MASK19_Pos)) /* Assignment of value for MASK19 in the MCLK_CLKMSK register */
#define   MCLK_CLKMSK_MASK19_0_Val            _UINT32_(0x0)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped  */
#define   MCLK_CLKMSK_MASK19_1_Val            _UINT32_(0x1)                                        /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled  */
#define MCLK_CLKMSK_MASK19_0                  (MCLK_CLKMSK_MASK19_0_Val << MCLK_CLKMSK_MASK19_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] stopped Position */
#define MCLK_CLKMSK_MASK19_1                  (MCLK_CLKMSK_MASK19_1_Val << MCLK_CLKMSK_MASK19_Pos) /* (MCLK_CLKMSK) Peripheral clock mclk_clk_periph[n*32+x] enabled Position */
#define MCLK_CLKMSK_MASK20_Pos                _UINT32_(20)                                         /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Position */
#define MCLK_CLKMSK_MASK20_Msk                (_UINT32_(0x1) << MCLK_CLKMSK_MASK20_Pos)            /* (MCLK_CLKMSK) Peripheral Clock Enable Mask Mask */
