Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/component/mclk.h
/* MCLK register offsets definitions */
#define MCLK_INTENCLR_REG_OFST         _UINT32_(0x00)      /* (MCLK_INTENCLR) Interrupt Enable Clear Register Offset */
#define MCLK_INTENSET_REG_OFST         _UINT32_(0x04)      /* (MCLK_INTENSET) Interrupt Enable Set Register Offset */
#define MCLK_INTFLAG_REG_OFST          _UINT32_(0x08)      /* (MCLK_INTFLAG) Interrupt Flag Status Register Offset */
#define MCLK_CLKDIV_REG_OFST           _UINT32_(0x0C)      /* (MCLK_CLKDIV) Clock Divider Control n Register Offset */
#define MCLK_CLKDIV0_REG_OFST          _UINT32_(0x0C)      /* (MCLK_CLKDIV0) Clock Divider Control n Register Offset */
#define MCLK_CLKDIV1_REG_OFST          _UINT32_(0x10)      /* (MCLK_CLKDIV1) Clock Divider Control n Register Offset */
#define MCLK_CLKDIV2_REG_OFST          _UINT32_(0x14)      /* (MCLK_CLKDIV2) Clock Divider Control n Register Offset */
#define MCLK_CLKMSK_REG_OFST           _UINT32_(0x3C)      /* (MCLK_CLKMSK) Peripheral Clock Enable Mask n Register Offset */
#define MCLK_CLKMSK0_REG_OFST          _UINT32_(0x3C)      /* (MCLK_CLKMSK0) Peripheral Clock Enable Mask n Register Offset */
#define MCLK_CLKMSK1_REG_OFST          _UINT32_(0x40)      /* (MCLK_CLKMSK1) Peripheral Clock Enable Mask n Register Offset */
#define MCLK_CLKMSK2_REG_OFST          _UINT32_(0x44)      /* (MCLK_CLKMSK2) Peripheral Clock Enable Mask n Register Offset */
#define MCLK_CLKMSK3_REG_OFST          _UINT32_(0x48)      /* (MCLK_CLKMSK3) Peripheral Clock Enable Mask n Register Offset */
#define MCLK_CLKMSK4_REG_OFST          _UINT32_(0x4C)      /* (MCLK_CLKMSK4) Peripheral Clock Enable Mask n Register Offset */
#define MCLK_CLKMSK5_REG_OFST          _UINT32_(0x50)      /* (MCLK_CLKMSK5) Peripheral Clock Enable Mask n Register Offset */
#define MCLK_CLKMSK6_REG_OFST          _UINT32_(0x54)      /* (MCLK_CLKMSK6) Peripheral Clock Enable Mask n Register Offset */
#define MCLK_CLKMSK7_REG_OFST          _UINT32_(0x58)      /* (MCLK_CLKMSK7) Peripheral Clock Enable Mask n Register Offset */
#define MCLK_CLKMSK8_REG_OFST          _UINT32_(0x5C)      /* (MCLK_CLKMSK8) Peripheral Clock Enable Mask n Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* MCLK register API structure */
typedef struct
{  /* Polaris Main Clock Controller */
  __IO  uint32_t                       MCLK_INTENCLR;      /* Offset: 0x00 (R/W  32) Interrupt Enable Clear Register */
  __IO  uint32_t                       MCLK_INTENSET;      /* Offset: 0x04 (R/W  32) Interrupt Enable Set Register */
  __O   uint32_t                       MCLK_INTFLAG;       /* Offset: 0x08 ( /W  32) Interrupt Flag Status Register */
  __IO  uint32_t                       MCLK_CLKDIV[3];     /* Offset: 0x0C (R/W  32) Clock Divider Control n Register */
  __I   uint8_t                        Reserved1[0x24];
  __IO  uint32_t                       MCLK_CLKMSK[9];     /* Offset: 0x3C (R/W  32) Peripheral Clock Enable Mask n Register */
} mclk_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMSG00_MCLK_COMPONENT_H_ */
